using System;
// Суть игры будет заключаться во взаимодействии со внешним виртуальным ограниченным миром
// Нужно осуществить взаимодействие игрока с инвентарём и со внешним миром
// Игра будет пошаговой, то есть игрок может делать какие-то действия и каждое действие будет считаться ходом,
// - или какоето колличество действий будут считаться за 1 ход(нужно придумать)
// Осуществить взаимодействие с предметами: поднять из внешнего мира, положить в инвентарь, использовать, выкинуть и тд.
// Добавить в игру ПРЕДМЕТЫ которыми можно будет наносить урон, бить или стрелять, перезаряжать, выкидывать и взрывать и тд.
// 
//
//
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
//
//
// Создать конкретный план разработки игры..
//
//
//
//===========================================================================================================================
//
//
//
/* План разработки игры:
 * 
 * 1. Первый шаг      -      создание ИНВЕНТАРЯ 
 * 2. Второй шаг      -      создание инвентаря ВНЕШНЕГО мира
 * 3. Третий шаг      -      обеспечить взаимодействие между ними
 * 4. Четвертый шаг   -      добавить ПРЕДМЕТЫ
 * 5. Пятый шаг       -      добавить взаимодействие с предметами
 * 6. Шестой шаг      -      реализовать очистку выброшеных вещей во внешний мир
 * ...
*/ 
namespace InteractiveGame
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Будущая игра находится на этапе мозгования)))");
        }
    }
}
